TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/pin_map.h
#define GPIO_55_GPIO55                  0x00480E00U
#define GPIO_55_SPIA_POCI               0x00480E01U
#define GPIO_55_EQEP2_B                 0x00480E05U
#define GPIO_55_OUTPUTXBAR3             0x00480E06U
#define GPIO_55_SD1_C4                  0x00480E07U
#define GPIO_55_ERRORSTS                0x00480E09U
#define GPIO_55_LINA_RX                 0x00480E0AU
#define GPIO_55_SD1_C3                  0x00480E0DU

#define GPIO_56_GPIO56                  0x00481000U
#define GPIO_56_SPIA_CLK                0x00481001U
#define GPIO_56_CLB_OUTPUTXBAR7         0x00481002U
#define GPIO_56_MCANA_TX                0x00481003U
#define GPIO_56_EQEP2_STROBE            0x00481005U
#define GPIO_56_SCIB_TX                 0x00481006U
#define GPIO_56_SD2_D1                  0x00481007U
#define GPIO_56_SPIB_PICO               0x00481009U
#define GPIO_56_I2CA_SDA                0x0048100AU
#define GPIO_56_EQEP1_A                 0x0048100BU
#define GPIO_56_SD1_C4                  0x0048100DU
#define GPIO_56_FSIRXA_D1               0x0048100EU

#define GPIO_57_GPIO57                  0x00481200U
#define GPIO_57_SPIA_PTE                0x00481201U
#define GPIO_57_CLB_OUTPUTXBAR8         0x00481202U
#define GPIO_57_MCANA_RX                0x00481203U
#define GPIO_57_EQEP2_INDEX             0x00481205U
#define GPIO_57_SCIB_RX                 0x00481206U
#define GPIO_57_SD2_C1                  0x00481207U
#define GPIO_57_SPIB_POCI               0x00481209U
#define GPIO_57_I2CA_SCL                0x0048120AU
#define GPIO_57_EQEP1_B                 0x0048120BU
#define GPIO_57_FSIRXA_CLK              0x0048120EU

#define GPIO_58_GPIO58                  0x00481400U
#define GPIO_58_OUTPUTXBAR1             0x00481405U
#define GPIO_58_SPIB_CLK                0x00481406U
#define GPIO_58_SD2_D2                  0x00481407U
#define GPIO_58_LINA_TX                 0x00481409U
#define GPIO_58_EQEP1_STROBE            0x0048140BU
#define GPIO_58_SD2_C2                  0x0048140DU
#define GPIO_58_FSIRXA_D0               0x0048140EU

#define GPIO_59_GPIO59                  0x00481600U
#define GPIO_59_OUTPUTXBAR2             0x00481605U
#define GPIO_59_SPIB_PTE                0x00481606U
#define GPIO_59_SD2_C2                  0x00481607U
#define GPIO_59_LINA_RX                 0x00481609U
#define GPIO_59_EQEP1_INDEX             0x0048160BU
#define GPIO_59_SD2_C3                  0x0048160DU

#define GPIO_60_GPIO60                  0x00481800U
#define GPIO_60_EPWM12_B                0x00481801U
#define GPIO_60_MCANA_TX                0x00481803U
#define GPIO_60_OUTPUTXBAR3             0x00481805U
#define GPIO_60_SPIB_PICO               0x00481806U
#define GPIO_60_SD2_D3                  0x00481807U
#define GPIO_60_SD2_C4                  0x0048180DU

#define GPIO_61_GPIO61                  0x00481A00U
#define GPIO_61_MCANA_RX                0x00481A03U
#define GPIO_61_OUTPUTXBAR4             0x00481A05U
#define GPIO_61_SPIB_POCI               0x00481A06U
#define GPIO_61_SD2_C3                  0x00481A07U

#define GPIO_62_GPIO62                  0x00481C00U
#define GPIO_62_EPWM10_A                0x00481C01U
#define GPIO_62_OUTPUTXBAR3             0x00481C02U
#define GPIO_62_MCANA_TX                0x00481C05U
#define GPIO_62_SCIA_TX                 0x00481C06U
#define GPIO_62_PMBUSA_SDA              0x00481C09U

#define GPIO_63_GPIO63                  0x00481E00U
#define GPIO_63_EPWM10_B                0x00481E01U
#define GPIO_63_OUTPUTXBAR4             0x00481E02U
#define GPIO_63_MCANA_RX                0x00481E05U
#define GPIO_63_SCIA_RX                 0x00481E06U
#define GPIO_63_LINA_RX                 0x00481E09U

#define GPIO_224_GPIO224                0x01C60000U
#define GPIO_224_EPWM11_B               0x01C60001U
#define GPIO_224_SD2_D3                 0x01C60002U
#define GPIO_224_OUTPUTXBAR3            0x01C60005U
#define GPIO_224_SPIA_PICO              0x01C60006U
#define GPIO_224_EPWM1_A                0x01C60009U
#define GPIO_224_MCANA_TX               0x01C6000AU
#define GPIO_224_EQEP1_A                0x01C6000BU
#define GPIO_224_ADCE_EXTMUXSEL3        0x01C6000DU
#define GPIO_224_SCIC_TX                0x01C6000EU

#define GPIO_225_GPIO225                0x01C60200U
#define GPIO_225_SD2_C2                 0x01C60202U

#define GPIO_226_GPIO226                0x01C60400U
#define GPIO_226_EPWM10_B               0x01C60401U
#define GPIO_226_SD2_D4                 0x01C60402U
#define GPIO_226_LINA_RX                0x01C60403U
#define GPIO_226_EPWM6_A                0x01C60405U
#define GPIO_226_SPIA_CLK               0x01C60406U
#define GPIO_226_EPWM1_B                0x01C60409U
#define GPIO_226_EQEP1_STROBE           0x01C6040BU
#define GPIO_226_ADCE_EXTMUXSEL1        0x01C6040DU
#define GPIO_226_SCIC_RX                0x01C6040EU

#define GPIO_227_GPIO227                0x01C60600U
#define GPIO_227_I2CB_SCL               0x01C60601U
#define GPIO_227_SD1_C3                 0x01C60602U
#define GPIO_227_EPWM3_A                0x01C60603U
#define GPIO_227_OUTPUTXBAR1            0x01C60605U
#define GPIO_227_EPWM2_B                0x01C60606U

#define GPIO_228_GPIO228                0x01C60800U
#define GPIO_228_EPWM10_A               0x01C60801U
#define GPIO_228_ADCSOCAO               0x01C60803U
#define GPIO_228_MCANA_TX               0x01C60805U
#define GPIO_228_SPIA_POCI              0x01C60806U
#define GPIO_228_SD2_C1                 0x01C60807U
#define GPIO_228_EPWM2_B                0x01C60809U
#define GPIO_228_EQEP1_B                0x01C6080BU
#define GPIO_228_ADCE_EXTMUXSEL0        0x01C6080DU

#define GPIO_229_GPIO229                0x01C60A00U

#define GPIO_230_GPIO230                0x01C60C00U
#define GPIO_230_I2CB_SDA               0x01C60C01U
#define GPIO_230_SD1_C4                 0x01C60C02U
#define GPIO_230_EPWM3_B                0x01C60C03U
#define GPIO_230_MCANA_RX               0x01C60C05U
#define GPIO_230_EPWM2_A                0x01C60C06U
#define GPIO_230_I2CA_SDA               0x01C60C07U
#define GPIO_230_PMBUSA_SCL             0x01C60C09U

#define GPIO_231_GPIO231                0x01C60E00U
#define GPIO_231_SD1_C1                 0x01C60E02U

