TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/pin_map.h
#define GPIO_232_GPIO232                0x01C61000U
#define GPIO_232_SD1_D4                 0x01C61002U

#define GPIO_233_GPIO233                0x01C61200U
#define GPIO_233_SD2_D1                 0x01C61202U

#define GPIO_234_GPIO234                0x01C61400U

#define GPIO_235_GPIO235                0x01C61600U

#define GPIO_236_GPIO236                0x01C61800U
#define GPIO_236_EPWM7_A                0x01C61801U
#define GPIO_236_EQEP1_INDEX            0x01C61805U
#define GPIO_236_EPWM12_A               0x01C61809U

#define GPIO_237_GPIO237                0x01C61A00U
#define GPIO_237_SD1_D2                 0x01C61A02U

#define GPIO_238_GPIO238                0x01C61C00U
#define GPIO_238_SD2_C3                 0x01C61C02U

#define GPIO_239_GPIO239                0x01C61E00U
#define GPIO_239_SD1_D1                 0x01C61E02U

#define GPIO_240_GPIO240                0x01C80000U
#define GPIO_240_SD2_C1                 0x01C80002U

#define GPIO_241_GPIO241                0x01C80200U
#define GPIO_241_SD2_C1                 0x01C80202U

#define GPIO_242_GPIO242                0x01C80400U
#define GPIO_242_EPWM11_A               0x01C80401U
#define GPIO_242_SD2_D2                 0x01C80402U
#define GPIO_242_OUTPUTXBAR2            0x01C80405U
#define GPIO_242_SPIA_PTE               0x01C80406U
#define GPIO_242_EPWM4_A                0x01C80409U
#define GPIO_242_MCANA_RX               0x01C8040AU
#define GPIO_242_EQEP1_INDEX            0x01C8040BU
#define GPIO_242_ADCE_EXTMUXSEL2        0x01C8040DU

#define GPIO_244_GPIO244                0x01C80800U
#define GPIO_244_SD1_D3                 0x01C80802U

#define GPIO_245_GPIO245                0x01C80A00U
#define GPIO_245_SD1_C2                 0x01C80A02U

#define GPIO_247_GPIO247                0x01C80E00U
#define GPIO_247_EPWM12_B               0x01C80E01U

#define GPIO_248_GPIO248                0x01C81000U

#define GPIO_249_GPIO249                0x01C81200U

#define GPIO_251_GPIO251                0x01C81600U

#define GPIO_252_GPIO252                0x01C81800U
#define GPIO_252_SD2_C4                 0x01C81802U

#define GPIO_253_GPIO253                0x01C81A00U
#define GPIO_253_EPWM12_A               0x01C81A01U

#endif // PIN_MAP_H
